{
  "backend/main.mo": "Motoko canister defining user profiles, access control, and detailed resident-related data types for medications, vitals, ADLs, and contacts.",
  "feature_evidence.json": "Feature evidence report mapping medication‑related UI requirements to specific frontend files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each major frontend file, including layout, pages, hooks, and modals.",
  "frontend/index.css": "Tailwind base styles and OKLCH color variables defining light/dark themes and global UI styling.",
  "frontend/index.html": "HTML entry file mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React router setup with authentication gating, profile initialization, and app shell rendering.",
  "frontend/src/components/adl/ADLTab.tsx": "Displays ADL records for a resident with a table view and an option to add new records.",
  "frontend/src/components/adl/modals/AddADLRecordModal.tsx": "Modal form for creating new ADL records with fields for date, activity, assistance level, and notes.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Reusable access‑denied screen with messaging and navigation back to the dashboard.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal for collecting and saving a new user's profile including name, role, and optional related resident IDs.",
  "frontend/src/components/layout/AppShell.tsx": "Layout wrapper handling authentication via Internet Identity and rendering login or full app UI with header, content, and footer.",
  "frontend/src/components/mar/MARTab.tsx": "Displays MAR records for a resident with a table view and provides an option to add new records if permitted.",
  "frontend/src/components/mar/modals/AddMARRecordModal.tsx": "Modal form for adding a new MAR record, allowing selection of active medications and entering administration details.",
  "frontend/src/components/medications/MedicationSections.tsx": "Renders active and discontinued medication lists with optional add, edit, and discontinue controls and physician info.",
  "frontend/src/components/medications/MedicationsTab.tsx": "Shows a resident's medications with add, edit, and discontinue actions and status badges.",
  "frontend/src/components/medications/modals/AddMedicationModal.tsx": "Modal form for creating a new medication for a resident, handling input fields, administration times, and submitting via mutation.",
  "frontend/src/components/medications/modals/EditMedicationModal.tsx": "Modal form for editing an existing medication, prefilled with current values and updating via mutation.",
  "frontend/src/components/residents/CodeStatusBadge.tsx": "Badge component that displays a resident’s code status as either DNR or Full Code with styled coloring.",
  "frontend/src/components/residents/modals/AddNewResidentModal.tsx": "Large modal for creating a new resident, capturing personal info, physicians, contacts, pharmacy data, and medications.",
  "frontend/src/components/residents/modals/EditResidentInformationModal.tsx": "Modal for editing an existing resident’s core information, physicians, and pharmacy details and saving via mutation.",
  "frontend/src/components/residents/ResidentProfilePrintReport.tsx": "Generates a printable resident profile report including demographics, physicians, and medication lists.",
  "frontend/src/components/vitals/DailyVitalsTab.tsx": "Displays a table of daily vitals for a resident and allows authorized users to record new vitals via modal.",
  "frontend/src/components/vitals/modals/RecordDailyVitalsModal.tsx": "Modal form for entering daily vital signs and submitting them via useAddDailyVitals.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor instance tied to Internet Identity and refreshes dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling login, stored identity loading, and status management.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks wrapping backend actor calls for profiles, residents, stats, and clinical data operations.",
  "frontend/src/index.css": "Tailwind base and theme variables plus print-specific styles for layout and visibility control.",
  "frontend/src/lib/auth/helpers.ts": "Helper functions determining user permissions and mapping user types to labels.",
  "frontend/src/main.tsx": "App entry point setting up React Query and Internet Identity providers before rendering the app.",
  "frontend/src/pages/ResidentDashboardPage.tsx": "Resident dashboard with filtering, sorting, stats display, and ability to add new residents.",
  "frontend/src/pages/ResidentProfilePage.tsx": "Resident profile page that loads resident data, manages multiple modals, medication actions, and UI tabs, with permissions and print support.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL and sessionStorage parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, animations, and plugins such as typography, container queries, and animate.",
  "project_state.json": "Project state file defining existing features, new feature requests, metadata, and versioning for build planning."
}