{
  "backend/main.mo": "Main backend actor defining access control, user profiles with a new showResidentProfileReport field, health checks, and resident-related data types.",
  "backend/migration.mo": "Migration that adds showResidentProfileReport=true to all existing user profiles when upgrading.",
  "feature_evidence.json": "Feature evidence report mapping backend and frontend files to two profile-report visibility features with test IDs and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file, including new UI behaviors tied to showResidentProfileReport.",
  "frontend/docs/release/promote-v22-to-production.md": "Release documentation for promoting Draft Version 22 to production with no code changes and preserved canister state.",
  "frontend/docs/release/promote-v27-to-production.md": "Release documentation for promoting Draft Version 27 to production, reusing existing build artifacts and preserving backend state.",
  "frontend/index.css": "Tailwind-based global CSS defining color tokens, dark mode variables, and global styling rules.",
  "frontend/index.html": "Base HTML page loading the React app with favicon links and the root mount point.",
  "frontend/src/App.tsx": "Sets up React Query, routing, authentication boot flow, backend actor initialization, and global app layout with loading and error handling.",
  "frontend/src/components/adl/ADLTab.tsx": "Displays a resident's ADL records in a table and allows adding new records when permitted.",
  "frontend/src/components/adl/modals/AddADLRecordModal.tsx": "Modal form for creating a new ADL record and submitting it via a mutation.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Shows an access denied message with a button to return to the dashboard.",
  "frontend/src/components/auth/BootErrorScreen.tsx": "Displays detailed boot-time errors with retry, logout, and diagnostic copy options.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal for first‑time users to create and save their profile and role settings.",
  "frontend/src/components/branding/Logo.tsx": "Renders the Moritz Care Home logo in different size variants.",
  "frontend/src/components/layout/AppShell.tsx": "Provides the main app layout with header, auth controls, navigation, and footer.",
  "frontend/src/components/mar/MARTab.tsx": "Displays MAR records for a resident and allows adding new records via modal if permitted.",
  "frontend/src/components/mar/modals/AddMARRecordModal.tsx": "Form modal for creating a new MAR record with medication selection and required fields.",
  "frontend/src/components/medications/administrationRoutes.ts": "Defines standard administration routes and a helper to include custom route values.",
  "frontend/src/components/medications/MedicationSections.tsx": "Renders active and discontinued medication sections with edit, discontinue, and reactivate actions.",
  "frontend/src/components/medications/MedicationsTab.tsx": "Shows a resident’s medications with options to add, edit, or discontinue when allowed.",
  "frontend/src/components/medications/modals/AddMedicationModal.tsx": "Modal for adding a medication with dosage, route, times, physician, and PRN options.",
  "frontend/src/components/medications/modals/EditMedicationModal.tsx": "Modal for editing an existing medication’s details including route, times, physician, and PRN state.",
  "frontend/src/components/residents/CodeStatusBadge.tsx": "Renders a badge showing a resident's code status, styling differently for DNR vs Full Code.",
  "frontend/src/components/residents/modals/AddNewResidentModal.tsx": "Provides a form modal to create a new resident with fields for personal info, physicians, contacts, medications, and insurance.",
  "frontend/src/components/residents/modals/EditResidentInformationModal.tsx": "Modal for editing existing resident details, including basic info, physicians, and pharmacy data.",
  "frontend/src/components/residents/ResidentProfilePrintReport.tsx": "Generates a printable resident profile report including demographics, physicians, medications, and code status.",
  "frontend/src/components/vitals/DailyVitalsTab.tsx": "Displays a resident's recorded daily vitals in a table and allows adding new entries if permitted.",
  "frontend/src/components/vitals/modals/RecordDailyVitalsModal.tsx": "Form modal for entering new daily vital sign measurements and submitting them to the backend.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages the backend actor, refreshing it when identity changes and invalidating dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity authentication, handling identity loading, login, logout, and status tracking. Wraps AuthClient setup with custom options and exposes identity state to consumers.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user profiles, residents, and related data through an authenticated actor. Includes admin checks, access filtering, retries, and toast notifications.",
  "frontend/src/hooks/useResilientActor.ts": "Creates and caches an authenticated or anonymous backend actor that retries on failure and invalidates dependent queries when ready. Supports forced retries and optional admin initialization via URL token.",
  "frontend/src/index.css": "Configures Tailwind base styles and theme variables, enforces solid backgrounds for UI components, and defines print styles. Includes light/dark mode palettes using OKLCH colors.",
  "frontend/src/lib/auth/helpers.ts": "Contains helper functions for authorization checks such as determining staff/admin privileges and resident access. Also maps user types to readable labels.",
  "frontend/src/main.tsx": "Bootstraps the React app by mounting it with React Query and Internet Identity providers. Imports global styles and renders the App component.",
  "frontend/src/pages/ResidentDashboardPage.tsx": "Implements the resident dashboard page with filtering, sorting, and stats display, using multiple data-fetching hooks. Includes UI for adding residents and navigating to resident details.",
  "frontend/src/pages/ResidentProfilePage.tsx": "Displays a resident’s profile with tabs, actions, and modals, conditionally showing the profile report and edit features based on user permissions and settings.",
  "frontend/src/pages/SettingsPage.tsx": "Provides a settings UI allowing users to toggle whether the Resident Profile Report is shown, saving the preference to the user profile.",
  "frontend/src/utils/dateOnly.ts": "Implements date-only parsing and age calculation utilities without timezone effects, plus simple age formatting.",
  "frontend/src/utils/errorDiagnostics.ts": "Normalizes unknown errors into structured diagnostic data and formats them for display or logging.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL parameters, persisting them in sessionStorage, and cleaning hash parameters.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS theme, colors, animations, and plugins used throughout the frontend.",
  "project_state.json": "Stores project metadata, requirements, and feature request tracking for the Resident Profile Report visibility toggle."
}