{
  "backend/main.mo": "Backend actor defining user profiles, permissions, and extensive resident-related data types with health/status queries and profile CRUD operations.",
  "feature_evidence.json": "Feature evidence report mapping UI transparency fixes and global styling safeguards to specific frontend files and components.",
  "frontend-file-summaries.txt": "List of summarized frontend files describing key components, modals, pages, CSS, hooks, and configuration behavior.",
  "frontend/docs/release/promote-v22-to-production.md": "Release notes documenting promotion of Draft Version 22 to production with checklists and verification steps.",
  "frontend/docs/release/promote-v27-to-production.md": "Release notes for promoting Draft Version 27 to production, outlining steps, checklists, and rollback plan.",
  "frontend/index.css": "Global CSS defining OKLCH theme variables, dark mode, and base styles using Tailwind layers.",
  "frontend/index.html": "Base HTML template loading the app root and favicon with script entry point to main.tsx.",
  "frontend/src/App.tsx": "Sets up routing and boot logic, handling identity, actor creation, profile loading, and retry flows with error toasts.",
  "frontend/src/components/adl/ADLTab.tsx": "Displays ADL records for a resident and allows adding new records via a modal when permitted.",
  "frontend/src/components/adl/modals/AddADLRecordModal.tsx": "Modal form for creating a new ADL record, submitting fields to the backend.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Shows an access denied message with a button to return to the dashboard.",
  "frontend/src/components/auth/BootErrorScreen.tsx": "Renders detailed boot‑time error diagnostics and provides retry and logout options.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Guides new users through completing their profile, including role and related resident IDs.",
  "frontend/src/components/branding/Logo.tsx": "Displays the Moritz Care Home logo with size variants.",
  "frontend/src/components/layout/AppShell.tsx": "Provides authenticated and login layouts with identity handling and logout/login controls.",
  "frontend/src/components/mar/MARTab.tsx": "Displays a resident's MAR records, allows adding new entries when permitted, and shows them in a table with medication names resolved from fetched data.",
  "frontend/src/components/mar/modals/AddMARRecordModal.tsx": "Modal for creating a new MAR record, providing medication selection, date/time, staff name, and optional notes before submitting via mutation.",
  "frontend/src/components/medications/administrationRoutes.ts": "Defines the fixed list of medication administration routes and provides a helper to include nonstandard existing values.",
  "frontend/src/components/medications/MedicationSections.tsx": "Renders active and discontinued medications with details, edit/discontinue actions, and physician lookup, optionally allowing additions.",
  "frontend/src/components/medications/MedicationsTab.tsx": "Displays a medication list for a resident with edit/discontinue options and supports adding or editing medications through modal dialogs.",
  "frontend/src/components/medications/modals/AddMedicationModal.tsx": "Modal for adding a medication with fields for dosage, route, times, physician, notes, and PRN handling, then submitting via mutation.",
  "frontend/src/components/medications/modals/EditMedicationModal.tsx": "Modal for editing an existing medication, allowing updates to details, administration times, PRN state, and physician before saving.",
  "frontend/src/components/residents/CodeStatusBadge.tsx": "Renders a badge showing a resident's code status, styled differently for DNR or Full Code.",
  "frontend/src/components/residents/modals/AddNewResidentModal.tsx": "Modal form for creating a new resident, including personal info, physicians, contacts, pharmacy, insurance, and medications.",
  "frontend/src/components/residents/modals/EditResidentInformationModal.tsx": "Modal for editing an existing resident’s basic info, physicians, and pharmacy details with tabbed sections.",
  "frontend/src/components/residents/ResidentProfilePrintReport.tsx": "Generates a printable resident profile report with demographics, physicians, medications, and code status.",
  "frontend/src/components/vitals/DailyVitalsTab.tsx": "Displays a table of a resident’s recorded daily vitals and provides a button to add new entries.",
  "frontend/src/components/vitals/modals/RecordDailyVitalsModal.tsx": "Modal form for entering and submitting a new set of daily vital sign measurements.",
  "frontend/src/hooks/useActor.ts": "Manages creation of a backend actor based on user identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication, including login, logout, and identity loading.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user profiles, residents, stats, and access-controlled resident lists via the backend actor.",
  "frontend/src/hooks/useResilientActor.ts": "Creates and caches a backend actor that auto-retries initialization and re-initializes on identity changes, with optional secret-based access control.",
  "frontend/src/index.css": "Tailwind CSS setup with a healthcare-themed OKLCH palette, enforced solid backgrounds for UI popovers, dark mode variables, and print-specific styles.",
  "frontend/src/lib/auth/helpers.ts": "Contains helper functions for checking user permissions and mapping user types to labels.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers before rendering the app.",
  "frontend/src/pages/ResidentDashboardPage.tsx": "Resident dashboard displaying resident stats, filtering and sorting tools, and an interface to add and navigate residents.",
  "frontend/src/pages/ResidentProfilePage.tsx": "Renders the resident profile with tabs, medication actions, and multiple modals, handling permissions and data loading.",
  "frontend/src/utils/dateOnly.ts": "Provides date-only parsing and age calculation utilities to avoid timezone issues.",
  "frontend/src/utils/errorDiagnostics.ts": "Normalizes unknown errors into structured diagnostics and formats them for display.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL and session parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, container, animations, and plugins for the frontend.",
  "project_state.json": "Describes the project state and requirements focused on removing UI transparency and addressing connection issues."
}