{
  "backend/main.mo": "Main backend actor implementing access control, user profiles, and extensive resident clinical data types with basic profile read/write APIs.",
  "backend/migration.mo": "Migration module defining old and new resident/medication schemas and data transformation logic for upgrades.",
  "feature_evidence.json": "Feature evidence report mapping PRN‑related medication UI features to their corresponding frontend files and components.",
  "frontend-file-summaries.txt": "Collection of autogenerated summaries describing key frontend components, pages, hooks, and styling files.",
  "frontend/docs/release/promote-v22-to-production.md": "Documentation for promoting Draft Version 22 to production using existing build artifacts with no code changes.",
  "frontend/docs/release/promote-v27-to-production.md": "Documentation for promoting Draft Version 27 to production as a release‑only update preserving all backend state.",
  "frontend/index.css": "Tailwind base/setup plus CSS variables defining light and dark theme colors and layout tokens.",
  "frontend/index.html": "HTML entry point loading the favicon, root div, and main TypeScript bundle.",
  "frontend/src/App.tsx": "Main application boot logic handling authentication, actor creation, profile fetching, routing, and deployment toasts.",
  "frontend/src/components/adl/ADLTab.tsx": "Displays a resident’s ADL records in a table and provides a modal to add new records if permitted.",
  "frontend/src/components/adl/modals/AddADLRecordModal.tsx": "Modal form for creating a new ADL record with fields for date, activity, assistance level, and notes.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "UI screen showing an access denied message with navigation back to the dashboard.",
  "frontend/src/components/auth/BootErrorScreen.tsx": "Error screen for failed actor/profile initialization with retry, logout, and diagnostic details.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal prompting new users to enter name, role, and optional related resident IDs, then save their profile.",
  "frontend/src/components/branding/Logo.tsx": "Renders the app logo with size variants for headers, login screens, icons, and small displays.",
  "frontend/src/components/layout/AppShell.tsx": "Defines the main layout with login handling, authentication actions, and shared header/footer UI.",
  "frontend/src/components/mar/MARTab.tsx": "Displays a resident’s MAR records with medication names and allows adding new records when permitted.",
  "frontend/src/components/mar/modals/AddMARRecordModal.tsx": "Modal form for creating a new MAR record with medication selection, time, staff, and notes.",
  "frontend/src/components/medications/MedicationSections.tsx": "Renders active and discontinued medications with physician info and edit/discontinue controls.",
  "frontend/src/components/medications/MedicationsTab.tsx": "Shows a resident’s medications with details and provides add, edit, and discontinue actions.",
  "frontend/src/components/medications/modals/AddMedicationModal.tsx": "Modal form to add a medication, including dosage, route, times, physician, notes, and PRN options.",
  "frontend/src/components/medications/modals/EditMedicationModal.tsx": "Modal form for editing an existing medication, managing PRN logic, administration times, and submitting updates via useUpdateMedication.",
  "frontend/src/components/residents/CodeStatusBadge.tsx": "Displays a resident's code status as a styled badge, switching appearance between DNR and Full Code.",
  "frontend/src/components/residents/modals/AddNewResidentModal.tsx": "Modal for creating a new resident with fields for personal info, physicians, contacts, pharmacy, insurance, and medications.",
  "frontend/src/components/residents/modals/EditResidentInformationModal.tsx": "Modal for updating resident information, including demographics, physicians, pharmacy data, and code status.",
  "frontend/src/components/residents/ResidentProfilePrintReport.tsx": "Generates a printable resident profile report including demographics, physicians, meds, and other details.",
  "frontend/src/components/vitals/DailyVitalsTab.tsx": "Displays a table of recorded daily vitals for a resident and provides a button to add new entries.",
  "frontend/src/components/vitals/modals/RecordDailyVitalsModal.tsx": "Modal for entering and submitting a new set of daily vital signs for a resident.",
  "frontend/src/hooks/useActor.ts": "Creates a backend actor tied to the user's identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth state, loading stored identities, and login/logout functionality via context.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for user profiles, residents, permissions, and related actor-backed data operations.",
  "frontend/src/hooks/useResilientActor.ts": "Initializes a fault-tolerant backend actor with retry logic and invalidates dependent queries when ready.",
  "frontend/src/index.css": "Tailwind-based global styles with OKLCH theme variables and print-specific formatting rules.",
  "frontend/src/lib/auth/helpers.ts": "Contains user permission helpers for staff/admin checks, resident access, and user type labeling.",
  "frontend/src/main.tsx": "Bootstraps the app with React Query and Internet Identity providers and renders the main App component.",
  "frontend/src/pages/ResidentDashboardPage.tsx": "UI page displaying resident lists, search/filter controls, and basic resident statistics using data hooks.",
  "frontend/src/pages/ResidentProfilePage.tsx": "React page showing a resident profile with tabs, medication management modals, and print support.",
  "frontend/src/utils/dateOnly.ts": "Utility functions for parsing YYYY-MM-DD dates and computing timezone‑safe age values.",
  "frontend/src/utils/errorDiagnostics.ts": "Normalizes unknown errors into structured diagnostics and formats them for display.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading, persisting, and clearing URL parameters using query strings and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom colors, container settings, animations, and plugins.",
  "project_state.json": "Project metadata tracking PRN medication feature requirements and current implementation state."
}