{
  "backend/main.mo": "Motoko canister implementing user profiles, resident records, and clinical data storage with access control checks and various ID counters.",
  "feature_evidence.json": "Empty feature evidence report with no listed features.",
  "frontend-file-summaries.txt": "Text file mapping frontend component paths to their summaries for documentation or tooling use.",
  "frontend/index.css": "Tailwind base styles defining color variables, dark mode values, and global background/foreground rules.",
  "frontend/index.html": "Basic HTML entry point loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router, authentication gating, profile setup flow, and root application shell.",
  "frontend/src/components/adl/ADLTab.tsx": "Displays resident ADL records in a table and provides a button to add new records when permitted.",
  "frontend/src/components/adl/modals/AddADLRecordModal.tsx": "Modal form for creating a new ADL record with required fields and submission via mutation hook.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Reusable screen showing an access-denied message with a button to return to the dashboard.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "A modal form that collects user profile details, including name, role, and optional related resident IDs, then saves the profile via a mutation.",
  "frontend/src/components/layout/AppShell.tsx": "Provides the main app layout with login handling, header, footer, and conditional login view using Internet Identity.",
  "frontend/src/components/mar/MARTab.tsx": "Displays a resident's MAR records with medication lookup and optionally allows adding new records via a modal.",
  "frontend/src/components/mar/modals/AddMARRecordModal.tsx": "Modal for adding a new MAR record, allowing selection of active medications and entering administration details.",
  "frontend/src/components/medications/MedicationsTab.tsx": "Shows a resident’s medications with details, supports adding, editing, and discontinuing medications when permitted.",
  "frontend/src/components/medications/modals/AddMedicationModal.tsx": "Modal for creating a new medication with dosage, administration details, times, physician, and notes, then submitting to the backend.",
  "frontend/src/components/medications/modals/EditMedicationModal.tsx": "Modal form for editing an existing medication, handling field updates, administration times, validation, and submitting updates via mutation.",
  "frontend/src/components/residents/modals/AddNewResidentModal.tsx": "Modal for creating a new resident with detailed inputs for personal info, physicians, contacts, medications, pharmacy, and insurance, then submitting via mutation.",
  "frontend/src/components/residents/modals/EditResidentInformationModal.tsx": "Modal for editing an existing resident’s core information, physicians, and pharmacy data, validating inputs and submitting updates via mutation.",
  "frontend/src/components/residents/ResidentProfilePrintReport.tsx": "Generates a multi‑page printable resident profile report including demographics, insurance, physicians, and medication details.",
  "frontend/src/components/vitals/DailyVitalsTab.tsx": "Displays a resident’s recorded daily vitals in a table and provides an option to open a modal to add new vitals.",
  "frontend/src/components/vitals/modals/RecordDailyVitalsModal.tsx": "Modal form for entering and submitting a new set of daily vital signs with validation and mutation.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the current Internet Identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for managing Internet Identity authentication, including login, logout, and identity persistence.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user profiles, residents, and related stats using the backend actor.",
  "frontend/src/index.css": "Defines Tailwind base styles, color variables, dark mode theming, and print-specific styles.",
  "frontend/src/lib/auth/helpers.ts": "Contains helper functions for checking user permissions and mapping user types to labels.",
  "frontend/src/main.tsx": "Initializes the React app with QueryClient and InternetIdentityProvider wrappers.",
  "frontend/src/pages/ResidentDashboardPage.tsx": "Implements the resident management dashboard with filters, stats, and actions such as adding, discharging, and deleting residents.",
  "frontend/src/pages/ResidentProfilePage.tsx": "Displays detailed resident information with access control, editing, printing options, and clinical tabs.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters (including hash routing), store and retrieve them from sessionStorage, persist URL-derived values, and remove parameters from the hash.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, animations, container settings, and plugins for typography, container queries, and animations.",
  "project_state.json": "Describes current project state, issues, and feature requests related to fixing backend handling of missing admin tokens during initialization."
}