{
  "backend/main.mo": "Main backend canister defining authorization, user profiles, app settings including new background mode, and resident-related types and access control checks.",
  "backend/migration.mo": "Migration module converting old app settings to include the new residentProfileEditorBackgroundMode field with a default of solid white.",
  "feature_evidence.json": "Feature evidence report mapping settings-background-mode features to affected frontend files and components with confidence ratings.",
  "frontend-file-summaries.txt": "Pre-written summaries of many frontend files describing recent UI, settings, and resident-management feature updates.",
  "frontend/docs/release/promote-v22-to-production.md": "Documentation for promoting Draft Version 22 to production with no code changes, including checklists and rollback steps.",
  "frontend/docs/release/promote-v27-to-production.md": "Documentation for promoting Draft Version 27 to production using existing artifacts, including verification and rollback procedures.",
  "frontend/index.css": "Global Tailwind base and theme variables defining colors, layout tokens, and dark mode values.",
  "frontend/index.html": "HTML entry point loading the app root and favicon, linking to main.tsx.",
  "frontend/src/App.tsx": "Initializes React Query, sets up TanStack Router routes for residents, settings, and profile-related pages, and wraps the app in providers.",
  "frontend/src/components/adl/ADLTab.tsx": "Displays a resident’s ADL records in a table and provides a modal to add new records when permitted.",
  "frontend/src/components/adl/modals/AddADLRecordModal.tsx": "Modal form for creating a new ADL record, handling required fields and submitting via a mutation.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Shows an access denied message with a button to return to the dashboard.",
  "frontend/src/components/auth/BootErrorScreen.tsx": "Displays detailed boot-time error information with retry, logout, and diagnostic copy options.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal for completing initial user profile setup, including role selection and optional related resident IDs.",
  "frontend/src/components/branding/Logo.tsx": "Renders the application logo with variant-based sizing.",
  "frontend/src/components/layout/AppShell.tsx": "Main layout providing sidebar navigation, authentication actions, and routing outlet handling.",
  "frontend/src/components/mar/MARTab.tsx": "Displays a resident’s MAR records in a table with an option to add new records if permitted.",
  "frontend/src/components/mar/modals/AddMARRecordModal.tsx": "Modal form for creating a new MAR record, including medication, time, staff, and notes.",
  "frontend/src/components/medications/administrationRoutes.ts": "Defines allowed administration routes and a helper for generating route options.",
  "frontend/src/components/medications/MedicationSections.tsx": "Renders active and discontinued medications with actions for adding, editing, discontinuing, and reactivating.",
  "frontend/src/components/medications/MedicationsTab.tsx": "Shows a resident’s medications with controls to add, edit, or discontinue them.",
  "frontend/src/components/medications/modals/AddMedicationModal.tsx": "Modal for adding a new medication with fields for dosage, route, times, physician, notes, and PRN.",
  "frontend/src/components/medications/modals/EditMedicationModal.tsx": "Modal for editing an existing medication, supporting updates to dosage, route, scheduling, notes, and PRN.",
  "frontend/src/components/resident-profile/ResidentProfileEditorSurface.tsx": "Wraps children in a div that applies background mode styling from a custom hook.",
  "frontend/src/components/resident-profile/sections/InsuranceInformationSection.tsx": "Displays a resident's insurance records in a table with add and edit navigation when editable.",
  "frontend/src/components/resident-profile/sections/PharmacyInformationSection.tsx": "Renders a pharmacy info table for a resident and supports adding or editing entries.",
  "frontend/src/components/resident-profile/sections/PhysicianInformationSection.tsx": "Shows assigned physicians in a table with optional add and edit actions.",
  "frontend/src/components/resident-profile/sections/ResponsiblePersonsSection.tsx": "Lists responsible contacts with relationship and communication details plus add/edit controls.",
  "frontend/src/components/residents/CodeStatusBadge.tsx": "Displays a badge indicating Full Code or DNR with corresponding styling.",
  "frontend/src/components/residents/modals/AddNewResidentModal.tsx": "Modal form for creating a new resident with fields for personal data, physicians, contacts, and medications.",
  "frontend/src/components/residents/modals/EditResidentInformationModal.tsx": "Modal form for editing a resident’s details, including personal info, room data, status, and pharmacy info, and submitting updates via useUpdateResident.",
  "frontend/src/components/residents/ResidentProfilePrintReport.tsx": "Generates a print‑friendly resident profile report including demographics and related data.",
  "frontend/src/components/vitals/DailyVitalsTab.tsx": "Displays a table of daily vital records for a resident and provides a button to open a modal for adding new vitals when permitted.",
  "frontend/src/components/vitals/modals/RecordDailyVitalsModal.tsx": "Modal form for entering and submitting new daily vital sign measurements using useAddDailyVitals.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor and refreshes dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and utilities for managing Internet Identity authentication, including login, logout, and identity persistence.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching and mutating backend data such as profiles, settings, residents, meds, vitals, and more.",
  "frontend/src/hooks/useResidentProfileEditorBackgroundMode.ts": "Reads display settings to determine the background mode and CSS class for the resident profile editor.",
  "frontend/src/hooks/useResilientActor.ts": "Initializes a resilient backend actor with retries, handles authenticated vs anonymous creation, and exposes refetch and retry controls.",
  "frontend/src/index.css": "Defines Tailwind layers, theme variables, dark mode settings, and custom background modes for the resident profile editor.",
  "frontend/src/lib/auth/helpers.ts": "Provides helper functions for permission checks and user type labels based on profile and admin status.",
  "frontend/src/lib/utils.ts": "Exports a utility function for merging class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Bootstraps the React app with query client and Internet Identity provider.",
  "frontend/src/pages/resident-profile/insurance/InsuranceAddPage.tsx": "Form page to add new insurance info for a resident and submit via mutation.",
  "frontend/src/pages/resident-profile/insurance/InsuranceEditPage.tsx": "Loads existing insurance data for a resident and provides a form to edit and update it.",
  "frontend/src/pages/resident-profile/pharmacy/PharmacyAddPage.tsx": "Form page for adding pharmacy details to a resident and saving via mutation.",
  "frontend/src/pages/resident-profile/pharmacy/PharmacyEditPage.tsx": "Fetches resident pharmacy info and allows editing and updating a specific pharmacy entry.",
  "frontend/src/pages/resident-profile/physicians/PhysicianAddPage.tsx": "Form to create a new physician entry for a resident and submit through an add mutation.",
  "frontend/src/pages/resident-profile/physicians/PhysicianEditPage.tsx": "Loads an existing physician record for a resident and provides a form to update it.",
  "frontend/src/pages/resident-profile/responsible-persons/ResponsiblePersonAddPage.tsx": "Page for adding a responsible contact to a resident, handling form state and submit via mutation then navigating back.",
  "frontend/src/pages/resident-profile/responsible-persons/ResponsiblePersonEditPage.tsx": "Page for editing an existing responsible contact, preloading data from resident info and submitting updates.",
  "frontend/src/pages/ResidentDashboardPage.tsx": "Displays resident statistics and a searchable, filterable list of residents with an option to add new ones.",
  "frontend/src/pages/ResidentProfilePage.tsx": "Shows detailed resident information with editing, medication management, vitals, and section navigation based on permissions.",
  "frontend/src/pages/SettingsPage.tsx": "Allows authenticated users to view and update display preferences such as print button visibility and editor background mode.",
  "frontend/src/utils/dateOnly.ts": "Utility for parsing YYYY-MM-DD dates and calculating timezone-safe ages with formatting helpers.",
  "frontend/src/utils/errorDiagnostics.ts": "Normalizes unknown errors into structured diagnostics and formats them for display or logging.",
  "frontend/src/utils/residentSorting.ts": "Sorting utilities for residents based on room numbers with optional secondary sorting by name or status.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading, persisting, and clearing URL parameters and session-stored values, including hash-based routing.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, themes, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Defines project metadata, architectural notes, existing features, and pending feature requests for display preference toggles and backend schema updates."
}