{
  "backend/main.mo": "Defines user profiles and extensive resident medical types with access-controlled CRUD operations, storing residents and related records in maps with incremental IDs.",
  "feature_evidence.json": "Lists feature evidence mapping print‑related requirements to affected frontend files and components with confidence metadata.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of many frontend files describing their roles in routing, UI, modals, and print layout.",
  "frontend/index.css": "Defines global Tailwind base styles with OKLCH color variables and dark mode support.",
  "frontend/index.html": "Basic HTML entry point loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router, authentication flow, profile setup gating, and main app shell rendering.",
  "frontend/src/components/adl/ADLTab.tsx": "Displays ADL records in a table with an optional add-record modal trigger.",
  "frontend/src/components/adl/modals/AddADLRecordModal.tsx": "Modal for adding an ADL record with form fields and mutation submission.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Reusable screen showing an access denied message with a button returning to the dashboard.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal for creating a user profile with name, role, and optional related resident IDs, saving via a profile mutation.",
  "frontend/src/components/layout/AppShell.tsx": "Application layout handling Internet Identity login/logout and rendering header, footer, and content.",
  "frontend/src/components/mar/MARTab.tsx": "Displays MAR records for a resident with an option to add new records if permitted.",
  "frontend/src/components/mar/modals/AddMARRecordModal.tsx": "Modal for adding a MAR record by selecting an active medication and entering administration details.",
  "frontend/src/components/medications/MedicationsTab.tsx": "Lists a resident's medications with options to add, edit, or discontinue them when allowed.",
  "frontend/src/components/medications/modals/AddMedicationModal.tsx": "Modal to add a new medication with dosage, timing, physician, and notes, submitting via mutation.",
  "frontend/src/components/medications/modals/EditMedicationModal.tsx": "Modal form allowing users to edit an existing medication’s details and submit updates via mutation.",
  "frontend/src/components/residents/modals/AddNewResidentModal.tsx": "Large modal for adding a new resident, including physicians, contacts, medications, and related info.",
  "frontend/src/components/residents/modals/EditResidentInformationModal.tsx": "Modal for editing an existing resident’s core information, physicians, and pharmacy details.",
  "frontend/src/components/residents/ResidentProfilePrintReport.tsx": "Print-only component generating a multi-page resident profile report including demographics and medications.",
  "frontend/src/components/vitals/DailyVitalsTab.tsx": "Displays a resident’s recorded daily vitals in a table and provides an option to add new vitals.",
  "frontend/src/components/vitals/modals/RecordDailyVitalsModal.tsx": "Form modal for recording a new set of daily vital signs and submitting them via mutation.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on the user’s identity and refreshes dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling login, stored identity loading, and state management.",
  "frontend/src/hooks/useQueries.ts": "Defines react-query hooks for fetching and mutating user profiles, residents, stats, and access‑controlled resident lists.",
  "frontend/src/index.css": "Tailwind CSS base styles, theme variables, dark mode settings, and detailed print-specific styling.",
  "frontend/src/lib/auth/helpers.ts": "Utility functions for determining user permissions and mapping user types to labels.",
  "frontend/src/main.tsx": "Initializes the app with React Query and Internet Identity providers and mounts the root component.",
  "frontend/src/pages/ResidentDashboardPage.tsx": "Displays resident management dashboard with filtering, sorting, stats, and actions like add, discharge, and delete.",
  "frontend/src/pages/ResidentProfilePage.tsx": "Shows detailed resident profile with access control, printable report, and optional editing for authorized users.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL params (including hash-based), persist them in sessionStorage, and clear them when needed.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, color tokens, shared styles, and plugin setup.",
  "project_state.json": "Describes the project’s state, existing features, new requests, and metadata for print layout work."
}