{
  "backend/main.mo": "Main backend canister defining health check, user profiles with access control, and extensive resident-related types and records.",
  "backend/migration.mo": "Migration module defining old and new data structures and logic scaffolding for transforming resident-related records across schema versions.",
  "feature_evidence.json": "Feature evidence report mapping features to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "List of summarized frontend file purposes describing routing, layouts, modals, hooks, styles, and resident-profile–related components.",
  "frontend/docs/release/promote-v22-to-production.md": "Documentation describing the release-only promotion of Draft Version 22 to production with checklists and verification steps.",
  "frontend/docs/release/promote-v27-to-production.md": "Documentation for promoting Draft Version 27 to production, outlining process, verification, and rollback steps.",
  "frontend/index.css": "Initializes Tailwind layers and defines extensive CSS variables for light and dark themes.",
  "frontend/index.html": "HTML entry point that loads the React app and sets favicon and metadata.",
  "frontend/src/App.tsx": "Configures React Query, theme provider, routing structure, and bootstraps the overall app shell.",
  "frontend/src/components/adl/ADLTab.tsx": "Displays a resident’s ADL records in a table with an option to add new records.",
  "frontend/src/components/adl/modals/AddADLRecordModal.tsx": "Modal form for creating a new ADL record with date, activity, assistance level, and notes.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Shows an access denied message with a button to return to the dashboard.",
  "frontend/src/components/auth/BootErrorScreen.tsx": "Displays detailed boot‑time error diagnostics with retry and logout options.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal for new users to set their name, role, and optional related resident IDs.",
  "frontend/src/components/branding/Logo.tsx": "Renders the Moritz Care Home logo in different size variants.",
  "frontend/src/components/layout/AppShell.tsx": "Layout shell managing authentication, navigation, header/footer, and rendering nested routes.",
  "frontend/src/components/mar/MARTab.tsx": "Displays a resident’s MAR records with medication names and provides a modal for adding new records.",
  "frontend/src/components/mar/modals/AddMARRecordModal.tsx": "Modal form for creating a MAR record, validating inputs, and submitting via mutation.",
  "frontend/src/components/medications/administrationRoutes.ts": "Defines allowed administration routes and helper to include non-standard route values.",
  "frontend/src/components/medications/MedicationSections.tsx": "Renders active and discontinued medications with details and optional edit/discontinue actions.",
  "frontend/src/components/medications/MedicationsTab.tsx": "Lists a resident’s medications, supports adding, editing, and discontinuing when permitted.",
  "frontend/src/components/medications/modals/AddMedicationModal.tsx": "Modal for adding a medication with fields for dosage, route, times, physician, notes, and PRN option.",
  "frontend/src/components/medications/modals/EditMedicationModal.tsx": "Modal component allowing users to edit medication details, manage administration times, and submit updates via mutation.",
  "frontend/src/components/resident-profile/sections/InsuranceInformationSection.tsx": "Displays a resident's insurance records in a table with options to add or edit entries.",
  "frontend/src/components/resident-profile/sections/PharmacyInformationSection.tsx": "Shows the resident's pharmacy information and provides navigation to add or edit pharmacy entries.",
  "frontend/src/components/resident-profile/sections/PhysicianInformationSection.tsx": "Lists assigned physicians with specialty and contact info, including edit and add actions.",
  "frontend/src/components/resident-profile/sections/ResponsiblePersonsSection.tsx": "Renders a table of responsible contacts with relationship and contact details, supporting add and edit actions.",
  "frontend/src/components/residents/CodeStatusBadge.tsx": "Badge component that visually displays a resident's code status as DNR or Full Code.",
  "frontend/src/components/residents/modals/AddNewResidentModal.tsx": "Form modal for creating a new resident, managing complex state for personal info, contacts, physicians, medications, and submitting via useAddResident.",
  "frontend/src/components/residents/modals/EditResidentInformationModal.tsx": "Modal allowing editing of an existing resident’s core information and pharmacy data, submitting updates through useUpdateResident.",
  "frontend/src/components/residents/ResidentProfilePrintReport.tsx": "Generates a printable resident profile report including personal info, physicians, medications, and other key details.",
  "frontend/src/components/vitals/DailyVitalsTab.tsx": "Displays a resident’s daily vitals in a table and provides a button to open the record-vitals modal when write access is allowed.",
  "frontend/src/components/vitals/modals/RecordDailyVitalsModal.tsx": "Input modal for recording daily vital signs, validating required fields and submitting values using useAddDailyVitals.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, handling login, stored identity loading, and AuthClient configuration.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching and mutating user profiles, residents, and permissions using the backend actor.",
  "frontend/src/hooks/useResilientActor.ts": "Initializes and caches a resilient backend actor with retry logic and identity handling.",
  "frontend/src/index.css": "Defines Tailwind base styles, color themes, solid dialog overrides, dark mode rules, and print styling.",
  "frontend/src/lib/auth/helpers.ts": "Implements simple authorization helpers for checking staff/admin access and resident visibility.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/resident-profile/insurance/InsuranceAddPage.tsx": "Provides a form to create and submit new insurance information for a resident. On save, it sends the data to the backend and navigates back to the resident profile.",
  "frontend/src/pages/resident-profile/insurance/InsuranceEditPage.tsx": "Loads an existing insurance entry for a resident, populates a form for editing, and submits updates. Navigates back to the resident profile after saving.",
  "frontend/src/pages/resident-profile/pharmacy/PharmacyAddPage.tsx": "Contains a form to add a new pharmacy record for a resident and submits the data through a mutation. Redirects back to the resident profile after saving.",
  "frontend/src/pages/resident-profile/pharmacy/PharmacyEditPage.tsx": "Fetches a specific pharmacy entry, pre-fills an edit form, and updates the pharmacy info on submit. Returns to the resident profile after saving changes.",
  "frontend/src/pages/resident-profile/physicians/PhysicianAddPage.tsx": "Provides a form for adding a physician to a resident's profile and submits the new physician data. Redirects to the resident profile after completion.",
  "frontend/src/pages/resident-profile/physicians/PhysicianEditPage.tsx": "Displays a form to edit a resident's physician, preloads existing data, and submits updates via a mutation.",
  "frontend/src/pages/resident-profile/responsible-persons/ResponsiblePersonAddPage.tsx": "Provides a form to add a new responsible contact for a resident and submits it through an add-contact mutation.",
  "frontend/src/pages/resident-profile/responsible-persons/ResponsiblePersonEditPage.tsx": "Loads an existing responsible contact, populates a form for editing, and updates the contact on submit.",
  "frontend/src/pages/ResidentDashboardPage.tsx": "Displays resident dashboard with stats, filters, search, and a UI to add new residents.",
  "frontend/src/pages/ResidentProfilePage.tsx": "Shows detailed resident profile with editing, clinical records, permissions checks, and modal workflows.",
  "frontend/src/pages/SettingsPage.tsx": "Displays and saves user settings, currently allowing toggling of the resident profile report visibility. Loads the user profile, tracks changes, and submits updates via a save action.",
  "frontend/src/utils/dateOnly.ts": "Implements timezone-safe date parsing and age calculation utilities, plus simple age formatting.",
  "frontend/src/utils/errorDiagnostics.ts": "Normalizes unknown errors into structured diagnostics and provides formatting for readable error output.",
  "frontend/src/utils/residentSorting.ts": "Defines helpers to sort residents by room number with optional name or status secondary sorting.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters from query or hash, persist them in sessionStorage, and clear them when needed.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, container settings, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Defines the project’s current feature set and architectural notes, focusing on expanding resident profiles with new multi-entry sidebar sections and dedicated add/edit screens."
}