{
  "backend/main.mo": "Defines authorization mixin and comprehensive resident-care data model plus user profile storage and access functions.",
  "feature_evidence.json": "Lists feature evidence entries mapping features to related source files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Provides prewritten one‑sentence summaries of various frontend files for reference.",
  "frontend/index.css": "Sets Tailwind base styles and OKLCH color variables for light and dark themes.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main app component handling identity boot flow, error detection, retry logic, routing, and profile setup modal.",
  "frontend/src/components/adl/ADLTab.tsx": "Displays ADL records in a table with an optional modal for adding new records.",
  "frontend/src/components/adl/modals/AddADLRecordModal.tsx": "Modal form for adding an ADL record, collecting date, activity, assistance level, and notes before submitting via mutation.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Displays an access denied message with optional custom text and a button to return to the dashboard.",
  "frontend/src/components/auth/BootErrorScreen.tsx": "Error screen shown when bootstrapping fails, offering retry, logout, and expandable error details.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal for initial user profile setup, allowing entry of name, role, and optional related resident IDs before saving.",
  "frontend/src/components/layout/AppShell.tsx": "Main layout wrapper handling authentication, login screen, header, footer, and rendering child content.",
  "frontend/src/components/mar/MARTab.tsx": "Displays a resident’s MAR records in a table and provides an option to add new records if permitted.",
  "frontend/src/components/mar/modals/AddMARRecordModal.tsx": "Modal for creating a MAR record, letting users select active medications and enter administration details.",
  "frontend/src/components/medications/MedicationSections.tsx": "Displays active and discontinued medications with edit, add, discontinue, and reactivate actions, using physician data for labeling.",
  "frontend/src/components/medications/MedicationsTab.tsx": "Renders a medications list with status badges and supports adding, editing, and discontinuing medications via modals and query hooks.",
  "frontend/src/components/medications/modals/AddMedicationModal.tsx": "Provides a form modal for creating a new medication, including dosage details, administration settings, and physician assignment.",
  "frontend/src/components/medications/modals/EditMedicationModal.tsx": "Modal for editing an existing medication, prefilled with its data and submitting updates through query hooks.",
  "frontend/src/components/residents/CodeStatusBadge.tsx": "Shows a badge for a resident’s code status, styled differently for DNR versus Full Code.",
  "frontend/src/components/residents/modals/AddNewResidentModal.tsx": "Modal component for creating a new resident with fields for personal info, physicians, contacts, medications, and related handlers.",
  "frontend/src/components/residents/modals/EditResidentInformationModal.tsx": "Modal for editing an existing resident’s information, prefilled with current data and submitting updates via a mutation.",
  "frontend/src/components/residents/ResidentProfilePrintReport.tsx": "Generates a printable resident profile report including personal info, physicians, pharmacy data, and medication lists.",
  "frontend/src/components/vitals/DailyVitalsTab.tsx": "Displays a resident’s daily vitals in a table and provides an option to open a modal for recording new vitals.",
  "frontend/src/components/vitals/modals/RecordDailyVitalsModal.tsx": "Modal form for submitting daily vital sign measurements for a resident using a mutation.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages a backend actor tied to the user’s identity and refreshes dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and hooks for managing Internet Identity authentication, including login, logout, and identity persistence.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching and mutating user profiles, residents, stats, and clinical data through the backend actor with access-control logic.",
  "frontend/src/hooks/useResilientActor.ts": "Initializes and manages a resilient backend actor tied to Internet Identity, auto-refreshing dependent queries when the actor changes.",
  "frontend/src/index.css": "Defines Tailwind base styles, CSS variables for light and dark themes, and print-specific styling rules.",
  "frontend/src/lib/auth/helpers.ts": "Implements user access-control helpers for checking admin/staff permissions and resident accessibility.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and loads global styles.",
  "frontend/src/pages/ResidentDashboardPage.tsx": "Displays resident statistics, search/filter tools, and a list of accessible residents with UI for adding new residents.",
  "frontend/src/pages/ResidentProfilePage.tsx": "Shows detailed resident information with tabs and modals for editing data, managing medications, recording clinical entries, and printing reports.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters (including hash routing) and persist them in sessionStorage, plus utilities to clear stored or hash parameters.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, container settings, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Defines the project’s state, known issues, and feature requests related to fixing recurring boot initialization errors and improving diagnostics and recovery."
}