{
  "backend/main.mo": "Motoko canister implementing authorization mixin, user profile storage, and extensive resident-related data types like vitals, ADLs, medications, and contacts.",
  "feature_evidence.json": "Feature evidence report describing a physician-signature print-layout feature and listing affected frontend components and metadata.",
  "frontend-file-summaries.txt": "Text file containing short summaries of all major frontend components, pages, hooks, and configuration files.",
  "frontend/index.css": "Tailwind-based global stylesheet defining OKLCH color variables, dark mode values, and base element styling.",
  "frontend/index.html": "Base HTML document providing root mount node and loading the main TypeScript entry file.",
  "frontend/src/App.tsx": "Main app entry configuring TanStack Router, authentication gating, profile-setup modal, and application shell layout.",
  "frontend/src/components/adl/ADLTab.tsx": "ADL tab component displaying ADL records in a table with optional add-record modal access.",
  "frontend/src/components/adl/modals/AddADLRecordModal.tsx": "Modal for submitting new ADL records with fields for date, activity, assistance level, and staff notes.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Component showing an access-denied message with a button to navigate back to the dashboard.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal that collects a user's name, role, and optional related resident IDs, then saves the profile via a mutation.",
  "frontend/src/components/layout/AppShell.tsx": "Layout wrapper handling login/logout via Internet Identity and rendering either a login screen or the main app shell with header and footer.",
  "frontend/src/components/mar/MARTab.tsx": "Displays a resident’s MAR records with medication names and allows adding new records when permitted.",
  "frontend/src/components/mar/modals/AddMARRecordModal.tsx": "Modal form for creating MAR records by selecting an active medication and entering administration details.",
  "frontend/src/components/medications/MedicationSections.tsx": "Renders active and discontinued medication lists with optional edit, add, discontinue, and reactivate actions.",
  "frontend/src/components/medications/MedicationsTab.tsx": "Shows a resident’s medications with status badges and supports adding, editing, and discontinuing medications when allowed.",
  "frontend/src/components/medications/modals/AddMedicationModal.tsx": "Modal form for creating a new medication, collecting dosage, route, times, physician, and notes, then submitting via useAddMedication.",
  "frontend/src/components/medications/modals/EditMedicationModal.tsx": "Modal for editing an existing medication with prefilled fields and updating it through useUpdateMedication.",
  "frontend/src/components/residents/CodeStatusBadge.tsx": "Displays a styled badge showing a resident’s code status as DNR or Full Code.",
  "frontend/src/components/residents/modals/AddNewResidentModal.tsx": "Large modal for creating a new resident with fields for personal info, physicians, contacts, pharmacy, insurance, and medications.",
  "frontend/src/components/residents/modals/EditResidentInformationModal.tsx": "Modal for editing resident demographics, physicians, room info, code status, and pharmacy details, then updating via useUpdateResident.",
  "frontend/src/components/residents/ResidentProfilePrintReport.tsx": "Generates a printable resident profile report including demographics, physicians, pharmacy info, and active/discontinued medications.",
  "frontend/src/components/vitals/DailyVitalsTab.tsx": "Displays a table of recorded daily vitals for a resident and provides an option to record new vitals if permitted.",
  "frontend/src/components/vitals/modals/RecordDailyVitalsModal.tsx": "Modal form for entering daily vital signs and submitting them via useAddDailyVitals.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the authenticated backend actor and refreshes dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, login handling, and identity persistence.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching and mutating user profiles, residents, vitals, and related data via the backend actor.",
  "frontend/src/index.css": "Tailwind CSS base setup with theme variables, dark mode, and print-specific styling.",
  "frontend/src/lib/auth/helpers.ts": "Helper functions for checking user permissions and mapping user types to labels.",
  "frontend/src/main.tsx": "App entry point initializing React, React Query, and Internet Identity provider.",
  "frontend/src/pages/ResidentDashboardPage.tsx": "Resident dashboard page showing stats, search/filter controls, and a sortable resident list with add-resident modal.",
  "frontend/src/pages/ResidentProfilePage.tsx": "Renders the resident profile page with tabs, medication management, vitals, ADLs, printing, and multiple edit/add modals. Handles permissions, data fetching, and user interactions for resident-related actions.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL parameters, persisting them in sessionStorage, and cleaning parameters from the URL hash. Supports hash-based and standard query strings.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, custom colors, animations, and plugins like typography, container queries, and animate. Sets project-wide styling tokens and responsive container settings.",
  "project_state.json": "Tracks project metadata, versions, features, and pending requests, including the feature for adding physician signature underline fields when a toggle is enabled."
}