{
  "backend/main.mo": "Defines user profiles, access-controlled profile operations, and extensive resident-related types for physicians, medications, vitals, ADL records, and more.",
  "feature_evidence.json": "Lists feature evidence entries mapping features to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of key frontend files including components, pages, hooks, and UI modules.",
  "frontend/index.css": "Tailwind base stylesheet defining OKLCH color variables, light/dark theme tokens, and global element styles.",
  "frontend/index.html": "HTML entry point setting up the root element and loading the main React script.",
  "frontend/src/App.tsx": "Configures the TanStack Router, authentication gating, and profile setup modal within the application shell.",
  "frontend/src/components/adl/ADLTab.tsx": "Displays ADL records for a resident and allows adding new records when permitted.",
  "frontend/src/components/adl/modals/AddADLRecordModal.tsx": "Modal form for adding a new ADL record with fields for date, activity, assistance level, and notes.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Reusable screen showing an access-denied message with a button returning users to the dashboard.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal that collects name, user type, and optional related resident IDs, then saves the user profile via a mutation.",
  "frontend/src/components/layout/AppShell.tsx": "Layout component handling login/logout with Internet Identity and rendering app header, footer, and children.",
  "frontend/src/components/mar/MARTab.tsx": "Displays a resident’s MAR records with medication lookup and provides a button to add new records when permitted.",
  "frontend/src/components/mar/modals/AddMARRecordModal.tsx": "Modal for creating a new MAR record by selecting an active medication and entering administration details.",
  "frontend/src/components/medications/MedicationSections.tsx": "Renders active and discontinued medication sections with edit, discontinue, and reactivate actions when allowed.",
  "frontend/src/components/medications/MedicationsTab.tsx": "Shows a list of medications for a resident with options to add, edit, or discontinue when write access is enabled.",
  "frontend/src/components/medications/modals/AddMedicationModal.tsx": "Modal form for creating a new medication for a resident, managing input fields and submitting via useAddMedication.",
  "frontend/src/components/medications/modals/EditMedicationModal.tsx": "Modal form for editing an existing resident medication, preloading values and submitting updates via useUpdateMedication.",
  "frontend/src/components/residents/CodeStatusBadge.tsx": "Badge component that displays a resident’s code status as either DNR or Full Code with styled variants.",
  "frontend/src/components/residents/modals/AddNewResidentModal.tsx": "Large modal for entering all resident onboarding data including demographics, physicians, contacts, medications, insurance, and pharmacy info.",
  "frontend/src/components/residents/modals/EditResidentInformationModal.tsx": "Modal for editing an existing resident’s information, including demographics, code status, physicians, and pharmacy data.",
  "frontend/src/components/residents/ResidentProfilePrintReport.tsx": "Print-only component generating a detailed resident profile report including personal info, physicians, medications, and pharmacy details.",
  "frontend/src/components/vitals/DailyVitalsTab.tsx": "Displays a table of daily vitals for a resident and provides a modal to record new vitals if the user has write permission.",
  "frontend/src/components/vitals/modals/RecordDailyVitalsModal.tsx": "Modal form for entering a resident’s daily vitals and submitting them via useAddDailyVitals.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor and invalidates dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, managing login, logout, identity persistence, and AuthClient setup.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching and mutating user profiles, residents, stats, and clinical data using the backend actor.",
  "frontend/src/index.css": "Tailwind CSS setup with theme variables, dark mode, and detailed print styles.",
  "frontend/src/lib/auth/helpers.ts": "Authorization helper functions for checking staff/admin privileges and resident access rules.",
  "frontend/src/main.tsx": "Application entry point initializing React, InternetIdentityProvider, QueryClientProvider, and global styles.",
  "frontend/src/pages/ResidentDashboardPage.tsx": "Resident dashboard that displays stats, searchable/sortable resident list, and modal for adding new residents.",
  "frontend/src/pages/ResidentProfilePage.tsx": "Resident profile page that loads resident data, manages medication and record modals, handles reactivation/discontinuation actions, and supports printing with optional physician signature toggle.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, colors, animations, and plugins like typography, container queries, and animate.",
  "project_state.json": "Project state file tracking schema version, current features, new feature requests, and summary of medication reactivation and physician signature behavior."
}