{
  "backend/main.mo": "Motoko canister defining user profiles, residents, medical info types, and authorization-aware getters and mutations for profile data.",
  "feature_evidence.json": "Metadata report linking implemented features to source files, components, and test IDs with high-confidence flags.",
  "frontend-file-summaries.txt": "JSON mapping of frontend file paths to brief functional descriptions for documentation or build tooling.",
  "frontend/index.css": "Tailwind base stylesheet defining color variables, light/dark themes, and global background/text styling.",
  "frontend/index.html": "HTML entry point providing root container and loading the main React module.",
  "frontend/src/App.tsx": "Main application wrapper handling routing, identity initialization, profile setup, boot error detection, and conditional rendering.",
  "frontend/src/components/adl/ADLTab.tsx": "ADL tab component that lists activities-of-daily-living records and provides a button to add new entries when permitted.",
  "frontend/src/components/adl/modals/AddADLRecordModal.tsx": "Modal form allowing users to input and submit new ADL records with required fields validated.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Displays an access denied message and a button to return to the dashboard.",
  "frontend/src/components/auth/BootErrorScreen.tsx": "Shows initialization errors with retry and logout options, including expandable error details.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal for entering and saving a new user profile with name, role, and optional related resident IDs.",
  "frontend/src/components/layout/AppShell.tsx": "Provides the app layout with login/logout handling and header/footer structure.",
  "frontend/src/components/mar/MARTab.tsx": "Displays a resident’s MAR records with medication lookup and optional modal to add new records.",
  "frontend/src/components/mar/modals/AddMARRecordModal.tsx": "Modal for creating a MAR record by selecting active medications and entering administration details.",
  "frontend/src/components/medications/MedicationSections.tsx": "Renders active and discontinued medication lists with optional actions to add, edit, discontinue, or reactivate medications.",
  "frontend/src/components/medications/MedicationsTab.tsx": "Displays a resident's medications, allowing adding, editing, and discontinuing entries using query hooks and modals.",
  "frontend/src/components/medications/modals/AddMedicationModal.tsx": "Modal form to create a new medication with dosage, route, times, physician, and notes, then submits via mutation.",
  "frontend/src/components/medications/modals/EditMedicationModal.tsx": "Modal for editing an existing medication's details and saving updates through a mutation.",
  "frontend/src/components/residents/CodeStatusBadge.tsx": "Renders a badge showing a resident's code status (DNR or Full Code) with conditional styling.",
  "frontend/src/components/residents/modals/AddNewResidentModal.tsx": "Modal for creating a new resident with fields for personal info, physicians, contacts, medications, and related data.",
  "frontend/src/components/residents/modals/EditResidentInformationModal.tsx": "Modal form for editing resident details, physicians, and pharmacy info, then submitting updates via useUpdateResident.",
  "frontend/src/components/residents/ResidentProfilePrintReport.tsx": "Generates a printable report of a resident including demographics, physicians, pharmacy info, and medications.",
  "frontend/src/components/vitals/DailyVitalsTab.tsx": "Displays a resident’s recorded daily vitals in a table and allows adding new vitals if permitted.",
  "frontend/src/components/vitals/modals/RecordDailyVitalsModal.tsx": "Modal for entering and submitting new daily vital sign measurements for a resident.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user’s identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides authentication state and logic for Internet Identity, including login, logout, and identity persistence.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching and mutating user profiles, residents, stats, medications, vitals, and related data via the backend actor.",
  "frontend/src/hooks/useResilientActor.ts": "Initializes a backend actor using react-query with identity support and optional admin token setup, and invalidates dependent queries when the actor changes.",
  "frontend/src/index.css": "Defines Tailwind base styles, CSS variables for themes, global styles, and detailed print-specific rules.",
  "frontend/src/lib/auth/helpers.ts": "Provides helper functions for checking user permissions and mapping user types to labels.",
  "frontend/src/main.tsx": "Bootstraps the React app with react-query and Internet Identity providers and loads global styles.",
  "frontend/src/pages/ResidentDashboardPage.tsx": "Displays a searchable, filterable dashboard of residents with summary stats and an option to add new residents.",
  "frontend/src/pages/ResidentProfilePage.tsx": "Shows detailed resident information with tabs, editing and medication management modals, and permission checks.",
  "frontend/src/utils/dateOnly.ts": "Implements timezone-safe date parsing and age calculation along with age formatting utilities.",
  "frontend/src/utils/urlParams.ts": "Handles reading, storing, and clearing URL parameters with session persistence and hash routing support.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, themes, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Defines the project's metadata, existing features, new feature requests, and architectural notes for age computation."
}