{
  "kind": "build_request",
  "title": "Prevent production app from hanging on loading when caffeineAdminToken is missing",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the backend implementation of the `_initializeAccessControlWithSecret` call path so that when the provided secret token is missing/empty (e.g., production URL has no `caffeineAdminToken`), the call returns promptly and does not hang or block actor initialization.",
      "target": "backend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "apply the fix so production stops getting stuck on loading",
          "the draft is working fine but the live app is stuck in the loading screen"
        ]
      },
      "acceptanceCriteria": [
        "When the frontend calls `await actor._initializeAccessControlWithSecret(adminToken)` with an empty string token, the call completes quickly (no indefinite await).",
        "Production build loads past the global loading spinner even when `caffeineAdminToken` is not present in the URL.",
        "Draft behavior continues to work when a valid `caffeineAdminToken` is present."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Ensure that the backend initialization behavior for `_initializeAccessControlWithSecret` remains safe: invalid/empty secrets must not grant admin privileges and must not weaken existing authorization checks for normal operations.",
      "target": "backend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "The fix is simple: you must make `_initializeAccessControlWithSecret` optional and only call it when the secret token is present."
        ]
      },
      "acceptanceCriteria": [
        "With an empty or invalid token, the caller does not become an admin and admin-only methods remain inaccessible.",
        "With a valid token (as used in draft), expected admin initialization still occurs."
      ]
    }
  ],
  "constraints": [
    "Frontend immutable file paths must not be edited, including `frontend/src/hooks/useActor.ts`.",
    "Keep the backend as a single Motoko actor in `backend/main.mo`; only add `backend/migration.mo` if a stable-state upgrade is required (it should not be required for this fix)."
  ],
  "nonGoals": [
    "Redesigning the loading screen UI/UX.",
    "Changing Internet Identity authentication flow or introducing a new authentication provider.",
    "Adding new product features unrelated to the production loading hang."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}