{
  "kind": "build_request",
  "title": "Add resident profile print toggle for physician name/signature fields",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-4",
      "text": "Add a visible toggle switch on the Resident Profile page that lets the user choose whether the printed Resident Profile Report includes additional blank fields for \"Physician's Name\" and \"Physician's Signature\".",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "add a visible toggle switch on the resident's profile for an option to print resident's profile with space for Physician's Name and Signature."
        ]
      },
      "acceptanceCriteria": [
        "ResidentProfilePage shows a clearly labeled toggle control in the header area near the existing Print action (screen-only; not shown in print).",
        "The toggle label is in English and clearly indicates that the printout will include space for Physician's Name and Signature.",
        "Toggling the switch immediately affects what will appear in the next print (no page reload required).",
        "Existing Print button behavior (calling window.print()) remains unchanged."
      ]
    },
    {
      "id": "REQ-5",
      "text": "Update the print-only Resident Profile Report so that, when the toggle is enabled, the printed document includes a dedicated area with blank lines for \"Physician's Name\" and \"Physician's Signature\" suitable for handwriting.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "add a visible toggle switch on the resident's profile for an option to print resident's profile with space for Physician's Name and Signature."
        ]
      },
      "acceptanceCriteria": [
        "ResidentProfilePrintReport accepts a boolean input (passed from ResidentProfilePage) that controls whether the physician name/signature blank area renders.",
        "When enabled, the print report includes both labels \"Physician's Name\" and \"Physician's Signature\" with visible blank line space to write on.",
        "When disabled, the physician name/signature blank area is not present anywhere in the printed output.",
        "Print layout remains readable and does not overlap existing content; page breaks remain valid (the report still prints cleanly)."
      ]
    },
    {
      "id": "REQ-6",
      "text": "Add any necessary print CSS to style the new physician name/signature blank lines so they print reliably (e.g., consistent line thickness, spacing) without impacting existing print report styling.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "add a visible toggle switch on the resident's profile for an option to print resident's profile with space for Physician's Name and Signature."
        ]
      },
      "acceptanceCriteria": [
        "New print-specific CSS classes (if needed) are added to frontend/src/index.css under the existing @media print section.",
        "The blank lines are visible on printed output and in print preview across common browsers.",
        "No regressions to existing print-only report styling (headers, section styling, tables, page breaks) are introduced."
      ]
    }
  ],
  "constraints": [
    "Do not modify any files under frontend/src/components/ui (they are read-only); compose existing UI components instead.",
    "Keep the backend unchanged (no new fields or persistence requirements for this toggle unless explicitly requested later)."
  ],
  "nonGoals": [
    "Persisting the toggle choice across sessions or users (unless explicitly requested later).",
    "Adding new backend APIs or storing physician signatures digitally."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}