{
  "kind": "build_request",
  "title": "Add settings toggle to show/hide Resident Profile Report on Resident Profile page",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add a user setting that controls visibility of the “Resident Profile Report” feature on the Resident Profile page, exposed as a toggle in a Settings UI (user-facing label in English).",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Hide it behind a toggle in settings"
        ]
      },
      "acceptanceCriteria": [
        "There is a Settings UI reachable in the app that contains a toggle for the Resident Profile Report feature.",
        "The toggle state is persisted per signed-in user (stored in the backend and reloaded on sign-in/reload).",
        "User-facing text for the setting is in English."
      ]
    },
    {
      "id": "REQ-2",
      "text": "When the Resident Profile Report setting is OFF, hide the Resident Profile Report-related UI on the Resident Profile page, including the Print Profile action and the print-only report content (ResidentProfilePrintReport). When the setting is ON, preserve the current behavior.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Hide it behind a toggle in settings"
        ]
      },
      "acceptanceCriteria": [
        "With the setting OFF, the Resident Profile page does not show the “Print Profile” button and does not render the ResidentProfilePrintReport component (so printing does not include the report).",
        "With the setting ON, the “Print Profile” button and ResidentProfilePrintReport behave as they do today.",
        "No other Resident Profile page sections/tabs are removed or changed by this setting."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Extend the backend user profile data model to store the Resident Profile Report visibility preference, and update the existing profile save/load flows to include this new preference (with a sensible default for new users).",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Hide it behind a toggle in settings"
        ]
      },
      "acceptanceCriteria": [
        "Backend Candid interface includes the new preference field as part of the user profile (or a dedicated user-settings structure) so it can be saved and fetched for the caller.",
        "New users who have not set the preference yet get a default value that keeps existing behavior (i.e., the report is available unless explicitly turned off).",
        "Existing frontend profile setup/save flows continue to work after the backend type/interface update."
      ]
    }
  ],
  "constraints": [
    "Frontend files under frontend/src/components/ui must not be edited; compose existing UI components instead.",
    "Do not modify immutable frontend hook files listed in SYSTEM_CONTEXT (use new hooks/modules/components where needed).",
    "Backend must remain a single Motoko actor in backend/main.mo; only add a migration file if it is strictly required for state upgrade."
  ],
  "nonGoals": [
    "Do not change role-based access rules or introduce new roles/permissions for viewing residents.",
    "Do not redesign or change the content/layout of ResidentProfilePrintReport beyond conditionally hiding it based on the setting.",
    "Do not add third-party authentication or any external storage/database."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}