{
  "kind": "build_request",
  "title": "Remove transparency from dialogs, dropdowns, and selection menus (solid white surfaces)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Ensure all pop-up dialog panels render with a fully opaque solid white background (no transparency, no blur/\"glass\" effect), including all modal forms (e.g., Profile Setup, Add/Edit Resident, Add/Edit Medication, Add MAR/ADL/Vitals).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "remove all transparencies in the app. all must be solid white pop-up dialogs, dropdown menus or selection menus"
        ]
      },
      "acceptanceCriteria": [
        "Every DialogContent panel in the app has an opaque solid white background (opacity 1) in both light and dark modes.",
        "No dialog panel uses semi-transparent Tailwind classes (e.g., bg-*/xx), backdrop-blur, or CSS opacity less than 1.",
        "Spot-check: AddMedicationModal DialogContent remains solid white (currently uses `dialog-solid-white`) and the same behavior is applied consistently to all other dialogs."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Ensure all dropdown menus and selection menus render with a fully opaque solid white background (no transparency) for the menu surface, including Select menus and any dropdown/popover-style menus used across the app.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "remove all transparencies in the app. all must be solid white pop-up dialogs, dropdown menus or selection menus"
        ]
      },
      "acceptanceCriteria": [
        "All SelectContent / dropdown menu content surfaces are solid white (opacity 1) and readable, with no translucency.",
        "No dropdown/select menu uses semi-transparent Tailwind classes (e.g., bg-*/xx) or backdrop blur for the menu surface.",
        "Visual verification: opening a route selector (e.g., Administration Route) shows an opaque white menu background."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Add/adjust global styling safeguards so that any future dialog/dropdown/select/popover surfaces cannot become transparent due to theme alpha values or component defaults, without modifying any files under `frontend/src/components/ui` (read-only).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "remove all transparencies in the app. all must be solid white pop-up dialogs, dropdown menus or selection menus"
        ]
      },
      "acceptanceCriteria": [
        "No changes are made to files in `frontend/src/components/ui/*`.",
        "Global CSS/theme adjustments prevent transparent popover/menu/dialog surfaces even if a consuming component forgets to pass an explicit solid background class.",
        "After the change, inspecting computed styles for menu/dialog surfaces shows an opaque white background color (no alpha channel) and opacity 1."
      ]
    }
  ],
  "constraints": [
    "Do not edit any files under `frontend/src/components/ui` (these paths are immutable/read-only)."
  ],
  "nonGoals": [
    "Do not change backend canister logic or data models.",
    "Do not redesign unrelated page layouts or typography beyond what is necessary to eliminate transparency on dialogs/menus.",
    "Do not change print-specific transparency rules unless they directly affect in-app dialogs/menus (print output is out of scope for this request)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}