{
  "kind": "build_request",
  "title": "Add Settings toggle for resident profile editor solid white/black background",
  "projectName": "Moritz Care Home",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Extend backend application display preferences to include a resident profile editor background mode toggle with two options (solid white and solid black), and expose it via the existing getAppSettings and updateDisplayPreferences APIs.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-4",
          "msg-5"
        ],
        "quotes": [
          "MAKE ALL TEXTS AND FORMS VISIBLE ON SOLID WHITE / SOLID BLACK BACKGROUND WHEN EDITING THE RESIDENT'S PROFILE",
          "1. toggle\n2. settings\n3. yes"
        ]
      },
      "acceptanceCriteria": [
        "Calling getAppSettings returns displayPreferences including the new editor background mode field.",
        "Calling updateDisplayPreferences persists the new editor background mode value alongside showPrintProfileButton.",
        "The backend continues to default to a sensible value (e.g., solid white) when the new preference has not been set yet."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Update the Settings page to include a new toggle control under Display Preferences that lets the user switch the resident profile editor background between solid white and solid black, and save it using the existing Save Changes flow.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "1. toggle\n2. settings\n3. yes"
        ]
      },
      "acceptanceCriteria": [
        "Settings displays a clearly labeled control (English UI text) for the resident profile editor background with two states: solid white and solid black.",
        "Changing the control causes the Save Changes button to appear (same behavior as existing showPrintProfileButton).",
        "After saving, the preference is persisted and is reflected on reload (via useGetAppSettings)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Apply the selected solid white/solid black background mode to all resident profile editing experiences (modal and form pages), and automatically adjust text, label, input, select, and textarea styling to ensure strong contrast and readability in both modes.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4",
          "msg-5"
        ],
        "quotes": [
          "MAKE ALL TEXTS AND FORMS VISIBLE ON SOLID WHITE / SOLID BLACK BACKGROUND WHEN EDITING THE RESIDENT'S PROFILE",
          "3. yes"
        ]
      },
      "acceptanceCriteria": [
        "When the editor background mode is set to solid white, resident profile edit screens render with a solid white background and dark, readable text; form controls remain clearly visible.",
        "When the editor background mode is set to solid black, resident profile edit screens render with a solid black background and light, readable text; form controls remain clearly visible.",
        "The behavior applies at minimum to the Edit Resident Information modal (frontend/src/components/residents/modals/EditResidentInformationModal.tsx) and the resident-profile add/edit pages (e.g., insurance/pharmacy/physicians/responsible persons).",
        "The chosen mode affects editing screens only and does not unintentionally force the entire app into light/dark mode."
      ]
    },
    {
      "id": "REQ-4",
      "text": "If the backend state schema requires upgrade handling, update the existing migration logic to ensure the new display preference field has a deterministic default after upgrade.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "1. toggle\n2. settings\n3. yes"
        ]
      },
      "acceptanceCriteria": [
        "Upgrading from the previous deployed version does not trap due to missing/new fields in DisplayPreferences.",
        "After upgrade, getAppSettings returns a valid editor background mode value without requiring manual admin intervention."
      ]
    }
  ],
  "constraints": [
    "Respect the single-actor backend architecture: implement all Motoko logic in backend/main.mo (only add/update backend/migration.mo if required for upgrade safety).",
    "Do not edit any files under frontend/src/components/ui (compose existing components instead).",
    "Do not edit immutable frontend hook entrypoints listed in SYSTEM_CONTEXT (frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx)."
  ],
  "nonGoals": [
    "Do not change print styles or the existing printable report behavior beyond what is necessary for the editor background toggle.",
    "Do not introduce third-party theming libraries or a new global dark-mode system; only implement the requested white/black editor background behavior.",
    "Do not add new authentication providers; keep current Internet Identity approach."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}