{
  "kind": "build_request",
  "title": "Show resident age on Resident Dashboard (timezone-safe DOB computation)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Display each resident’s age on the Resident Dashboard cards, computed from the resident’s date of birth (resident.dob) and shown alongside the existing DOB field.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages/user-1"
        ],
        "quotes": [
          "show resident's age in the residents dashboard (computed based on date of birth and no day/time shifting)"
        ]
      },
      "acceptanceCriteria": [
        "On the Residents Dashboard (frontend/src/pages/ResidentDashboardPage.tsx), each resident card shows an Age value derived from resident.dob.",
        "The age display is a whole number of years (e.g., \"Age: 78\").",
        "If resident.dob is missing/empty or not parseable, the UI does not crash and shows a sensible fallback (e.g., \"Age: —\")."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Implement a timezone-safe age calculation that does not shift the DOB by day due to local timezone/DST; compute using the DOB string’s year-month-day components rather than constructing a Date from an ISO datetime that can shift days.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages/user-1"
        ],
        "quotes": [
          "computed based on date of birth and no day/time shifting"
        ]
      },
      "acceptanceCriteria": [
        "The age calculation uses the DOB string (expected format from <input type=\"date\">, e.g., YYYY-MM-DD) and compares against today’s date using date-only logic (year/month/day), not a time-based conversion that can change the DOB day.",
        "For a DOB close to a day boundary (e.g., \"2000-01-01\"), the computed age is the same regardless of the user’s local timezone.",
        "Age increments on the resident’s birthday (based on month/day comparison), not at an arbitrary time of day."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui or any paths listed in frontend.immutablePaths.",
    "Keep backend as a single-actor Motoko canister; do not introduce additional services."
  ],
  "nonGoals": [
    "Do not change how DOB is stored or validated in the backend Resident model (currently a Text field).",
    "Do not add age to other pages (e.g., Resident Profile, print reports) unless explicitly requested.",
    "Do not add new filtering/sorting by age."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}