{
  "kind": "build_request",
  "title": "Promote Draft Version 27 to Production as “Moritz Care Home”",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Promote (release-only) Draft Version 27 to the Production environment with the production release name exactly set to “Moritz Care Home”, reusing existing build artifacts and preserving all backend canister state/data (no code changes as part of this promotion).",
      "target": "unknown",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "push draft version 27 to production",
          "1. yes\n2. Moritz Care Home"
        ]
      },
      "acceptanceCriteria": [
        "Production environment points to Draft Version 27 build artifacts.",
        "Production release name is “Moritz Care Home”.",
        "No frontend or backend code changes are introduced as part of the promotion.",
        "Existing backend canister state/data is preserved (no resets/wipes)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Add a new release promotion document for this production promotion by creating a Markdown file under frontend/docs/release/ that mirrors the structure of frontend/docs/release/promote-v22-to-production.md, but updated for Draft Version 27 and the release name “Moritz Care Home”, including pre-promotion checklist, promotion steps, post-promotion verification checklist, rollback plan, and a post-deployment notes section.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "push draft version 27 to production",
          "2. Moritz Care Home"
        ]
      },
      "acceptanceCriteria": [
        "A new Markdown file exists under frontend/docs/release/ documenting promotion of Draft Version 27 to Production (modeled after promote-v22-to-production.md).",
        "The document explicitly states Version 27 and the release name “Moritz Care Home”.",
        "The document includes: pre-promotion checklist, promotion process steps, post-promotion verification checklist, rollback plan, and post-deployment notes placeholders."
      ]
    }
  ],
  "constraints": [
    "Do not modify frontend or backend application code as part of this release-only production promotion.",
    "Preserve all existing backend canister state/data during promotion."
  ],
  "nonGoals": [
    "Implementing new application features or UI changes.",
    "Changing branding assets, logos, or favicon files.",
    "Backend schema/type migrations."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}