{
  "kind": "build_request",
  "title": "Add PRN checkbox to Medication form and persist PRN flag",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add a boolean PRN flag to the Medication data model in the backend and ensure it is persisted and returned in all resident medication read/write operations.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-6",
          "msg-8"
        ],
        "quotes": [
          "add checkbox for PRN alongside Administration Time in the Add Medications",
          "add a PRN checkbox next to Administration Time, and when checked it will hide/disable that time field and store PRN as a boolean."
        ]
      },
      "acceptanceCriteria": [
        "Backend `Medication` type includes a boolean field representing PRN (e.g., `isPRN : Bool`).",
        "`addMedicationToResident` stores the PRN value from the provided medication payload.",
        "`updateMedication` stores updates to the PRN value.",
        "Queries that return medications (e.g., `getMedications`, `getResident`) include the PRN field in returned medication records.",
        "If PRN is not provided by older clients, backend behavior defaults PRN to `false` (no traps)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Update the Add Medication modal UI to include a PRN checkbox positioned next to the Administration Times label, and when PRN is checked hide/disable the Administration Times inputs and suppress any related validation errors.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6",
          "msg-8",
          "msg-9"
        ],
        "quotes": [
          "1. next to the Administration Time",
          "add a PRN checkbox next to Administration Time, and when checked it will hide/disable that time field and store PRN as a boolean.",
          "yes"
        ]
      },
      "acceptanceCriteria": [
        "Add Medication modal shows a PRN checkbox aligned next to the Administration Times label/header.",
        "When PRN is checked, the time input(s) are hidden or disabled and are not marked as required (no browser validation prompts for time).",
        "When PRN is checked, submission succeeds even if administrationTimes are empty.",
        "When PRN is unchecked, Administration Times behave as before (including required validation).",
        "Submitting the Add Medication form sends the PRN boolean to the backend and stores it on the medication record."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Update the Edit Medication modal to display and allow editing the PRN flag with the same hide/disable and validation-suppression behavior for Administration Times when PRN is checked.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-8",
          "msg-9"
        ],
        "quotes": [
          "add a PRN checkbox next to Administration Time, and when checked it will hide/disable that time field and store PRN as a boolean.",
          "yes"
        ]
      },
      "acceptanceCriteria": [
        "Edit Medication modal includes the PRN checkbox in the same position as Add Medication (next to Administration Times).",
        "If an existing medication has PRN=true, the modal initially renders with PRN checked and the time inputs hidden/disabled and not required.",
        "Toggling PRN on/off immediately updates visibility/disabled state and required validation of time inputs.",
        "Saving changes persists the PRN value to the backend."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Update medication list display to clearly represent PRN medications and avoid showing administration times when PRN is true.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6",
          "msg-8"
        ],
        "quotes": [
          "add checkbox for PRN alongside Administration Time in the Add Medications",
          "store PRN as a boolean"
        ]
      },
      "acceptanceCriteria": [
        "In the medications list, medications with PRN=true are labeled as PRN (e.g., a small 'PRN' badge or text).",
        "For PRN medications, the UI does not render the 'Times:' line (or renders it only when non-PRN).",
        "Non-PRN medications display times exactly as before."
      ]
    }
  ],
  "constraints": [
    "Do not edit any files under frontend/src/components/ui or any paths listed as immutable in SYSTEM_CONTEXT.",
    "Keep all Motoko backend logic in the single actor at backend/main.mo (no additional backend services).",
    "Use English for any new user-facing text."
  ],
  "nonGoals": [
    "Changing the MAR (Medication Administration Record) workflow or adding PRN handling to MAR entries.",
    "Adding new authentication methods beyond Internet Identity.",
    "Introducing external databases or third-party services."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}