{
  "kind": "build_request",
  "title": "Add writable underlines for Physician Name, Signature, and Date when physician signature toggle is on",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-5",
      "text": "When the \"Show Physician Signature Fields\" toggle is ON, update the printed report’s final-page physician signature section to include three writable underline lines for manual writing: (1) Physician Name, (2) Physician Signature, and (3) Date. Each field must show its label followed by an underline line suitable for handwriting.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "include underline after Physician's Name, Signature and Date where they can write manually when toggle is on"
        ]
      },
      "acceptanceCriteria": [
        "With the toggle OFF, the printed report does not show the physician signature section.",
        "With the toggle ON, the printed report shows three fields labeled exactly: \"Physician Name:\", \"Physician Signature:\", and \"Date:\".",
        "Each of the three fields renders an underline line (matching the existing print signature line style) that provides space for handwriting when the page is printed.",
        "No backend changes are required; the change is purely presentational in the print report component."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (read-only UI components).",
    "Keep all backend logic in a single Motoko actor (no backend changes expected for this request)."
  ],
  "nonGoals": [
    "Do not change the toggle behavior, placement, or label text beyond what is necessary to add the Date underline field.",
    "Do not add digital signature capture or store signature/date values in the backend."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}