{
  "kind": "build_request",
  "title": "Add Resident Code Status (Full Code / DNR) and highlight it on the Residents Dashboard",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add a persistent \"Code Status\" field to each Resident record in the backend with exactly two supported values: \"Full Code\" and \"DNR\".",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Add Code Status (Full Code / DNR) for every Resident's Profile that will be shown in BOLD/Highlight in the Residents Dashboard."
        ]
      },
      "acceptanceCriteria": [
        "Backend exposes Resident records that include a code status field.",
        "The code status field only supports the two values \"Full Code\" and \"DNR\" (no free-text)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Implement upgrade-safe state migration so that all existing stored residents receive a valid default Code Status value (default to \"Full Code\") after deployment.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Add Code Status (Full Code / DNR) for every Resident's Profile"
        ]
      },
      "acceptanceCriteria": [
        "After upgrading, previously-created residents can still be fetched without traps/serialization errors.",
        "All residents returned from getResident/getAllResidents have a non-null code status value.",
        "Residents created before the change show code status = \"Full Code\" unless later edited."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Update the \"Add New Resident\" and \"Edit Resident\" flows to allow staff/admin users to set or change the Resident Code Status (Full Code / DNR).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Add Code Status (Full Code / DNR) for every Resident's Profile"
        ]
      },
      "acceptanceCriteria": [
        "Add New Resident modal includes a required Code Status control with options \"Full Code\" and \"DNR\".",
        "Edit Resident Information modal includes a Code Status control with the same two options and saves changes successfully.",
        "Saving a resident persists code status and it remains correct after refresh/navigation."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Display each resident’s Code Status on the Residents Dashboard in a bold, visually highlighted style that clearly distinguishes \"DNR\" from \"Full Code\".",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "will be shown in BOLD/Highlight in the Residents Dashboard."
        ]
      },
      "acceptanceCriteria": [
        "Each resident card on the dashboard shows a visible \"Code Status\" label/value.",
        "The Code Status value is rendered with bold styling.",
        "\"DNR\" is visually highlighted more strongly than \"Full Code\" (e.g., higher-contrast badge/background/text treatment) while remaining readable in the existing dashboard design.",
        "If a resident has the defaulted value from migration, it still displays correctly on the dashboard."
      ]
    },
    {
      "id": "REQ-5",
      "text": "Show the resident’s Code Status on the Resident Profile page so the Code Status is visible when viewing an individual resident record.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Add Code Status (Full Code / DNR) for every Resident's Profile"
        ]
      },
      "acceptanceCriteria": [
        "Resident Profile page displays the resident’s Code Status with the exact user-facing text \"Full Code\" or \"DNR\".",
        "The displayed Code Status matches what is shown on the dashboard for the same resident."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo.",
    "If existing stable state shape is changed, provide a conditional migration using backend/migration.mo per the project migration policy.",
    "Do not edit any files under frontend/src/components/ui or any other paths listed as immutable in SYSTEM_CONTEXT."
  ],
  "nonGoals": [
    "Do not implement additional clinical code status options beyond \"Full Code\" and \"DNR\".",
    "Do not add role/permission changes beyond existing staff/admin edit permissions.",
    "Do not add real-time updates or notifications for code status changes."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}