{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Separate active vs discontinued medications in resident medication views",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Split the resident medications UI into separate sections for active and discontinued medications, keeping discontinued meds view-only and without strikethrough styling.",
      "acceptanceCriteria": [
        "In the resident medications view, medications with isActive=true are shown under a 'Current Medications' (or 'Active Medications') section/table.",
        "Medications with isActive=false are shown under a separate 'Discontinued Medications' section/table on the same screen.",
        "Discontinued medications are not rendered with crossed-out/strikethrough styles; they are visually separated by the discontinued section/table instead.",
        "If there are no discontinued medications, the discontinued section/table is either hidden or shows an appropriate empty-state message (e.g., 'No discontinued medications').",
        "Existing actions remain sensible: discontinue/edit actions are only available for active medications (as they are today), and discontinued medications are view-only."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/medications/MedicationSections.tsx",
          "operation": "create",
          "description": "Create a reusable medications renderer that accepts a list of Medication items and renders two clearly labeled sections: 'Current/Active Medications' and 'Discontinued Medications'. Ensure the discontinued section is view-only (no edit/discontinue controls) and uses no crossed-out/strikethrough styling. Use existing shadcn-ui building blocks (e.g., Card, Badge, Button) to keep visuals consistent; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/medications/MedicationsTab.tsx",
          "operation": "modify",
          "description": "Update the medications tab to use the new MedicationSections component: partition the fetched medications into active vs discontinued and render them in separate labeled sections/tables. Keep add/edit/discontinue actions available only within the active section when canWrite is true, and show an empty-state for the discontinued section (or hide it) when there are none. Use existing shadcn-ui components already used in this file; verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Update ResidentProfilePage Medications tab to show discontinued medications in a separate section/table alongside active medications.",
      "acceptanceCriteria": [
        "On ResidentProfilePage, the Medications tab lists active medications in the current section and additionally lists discontinued medications in a separate section/table below (or otherwise clearly separated).",
        "When a medication is discontinued, it no longer appears in the active section and appears in the discontinued section after data refresh (React Query invalidation already in place)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/ResidentProfilePage.tsx",
          "operation": "modify",
          "description": "Replace the current Medications tab rendering (which filters to active only) with a two-section layout that shows active medications and a separate discontinued medications section/table on the same screen. Reuse MedicationSections for consistent behavior and to ensure discontinued medications are view-only. Keep existing modal wiring (add/edit/discontinue) operating only on active medications. Use existing shadcn-ui components already used in this page; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/medications/MedicationSections.tsx",
          "operation": "modify",
          "description": "Ensure MedicationSections supports the ResidentProfilePage use-case: allow callers to optionally provide handlers for edit/discontinue that are applied only to active medications, and provide an empty-state behavior for when there are no discontinued medications. Use existing shadcn-ui components; verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}