{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add PRN checkbox to medication modals and reflect PRN in medication display",
  "requirements": [
    {
      "id": "REQ-2",
      "summary": "Add PRN checkbox to Add Medication modal; when checked, hide/disable administration times and suppress time validation; submit PRN boolean.",
      "acceptanceCriteria": [
        "Add Medication modal shows a PRN checkbox aligned next to the Administration Times label/header.",
        "When PRN is checked, the time input(s) are hidden or disabled and are not marked as required (no browser validation prompts for time).",
        "When PRN is checked, submission succeeds even if administrationTimes are empty.",
        "When PRN is unchecked, Administration Times behave as before (including required validation).",
        "Submitting the Add Medication form sends the PRN boolean to the backend and stores it on the medication record."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/medications/modals/AddMedicationModal.tsx",
          "operation": "modify",
          "description": "Introduce local isPRN state and render a PRN checkbox next to the Administration Times header. When isPRN is true, hide/disable the administration time inputs and the “Add Time” control, ensure time inputs are not marked required, and ensure submission allows empty administrationTimes. Include isPRN in the Medication payload sent via useAddMedication."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Add PRN checkbox to Edit Medication modal with correct initial state; toggle updates times visibility/validation; save persists PRN.",
      "acceptanceCriteria": [
        "Edit Medication modal includes the PRN checkbox in the same position as Add Medication (next to Administration Times).",
        "If an existing medication has PRN=true, the modal initially renders with PRN checked and the time inputs hidden/disabled and not required.",
        "Toggling PRN on/off immediately updates visibility/disabled state and required validation of time inputs.",
        "Saving changes persists the PRN value to the backend."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/medications/modals/EditMedicationModal.tsx",
          "operation": "modify",
          "description": "Add isPRN state initialized from medication.isPRN and render a PRN checkbox next to the Administration Times header matching Add Medication. When isPRN is true, hide/disable time inputs and remove required validation; when toggled off, restore prior behavior and ensure at least one time input is available for required validation. Include isPRN in the updatedMedication payload passed to useUpdateMedication."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Update medication list UI to label PRN medications and avoid showing administration times when PRN is true.",
      "acceptanceCriteria": [
        "In the medications list, medications with PRN=true are labeled as PRN (e.g., a small 'PRN' badge or text).",
        "For PRN medications, the UI does not render the 'Times:' line (or renders it only when non-PRN).",
        "Non-PRN medications display times exactly as before."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/medications/MedicationSections.tsx",
          "operation": "modify",
          "description": "Adjust the medication card rendering to display a clear PRN label (e.g., small 'PRN' badge/text) when medication.isPRN is true, and conditionally omit the Times block/line for PRN medications while leaving non-PRN times rendering unchanged in both active and discontinued sections."
        },
        {
          "path": "frontend/src/components/medications/MedicationsTab.tsx",
          "operation": "modify",
          "description": "Update the medications list item display to add a PRN label when medication.isPRN is true and to avoid rendering the 'Times:' line for PRN medications; preserve existing times display for non-PRN medications."
        }
      ]
    }
  ]
}