{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Resident Dashboard: timezone-safe age display from DOB",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Show each resident’s computed age on Resident Dashboard cards alongside the existing DOB field, with safe fallbacks.",
      "acceptanceCriteria": [
        "On the Residents Dashboard (frontend/src/pages/ResidentDashboardPage.tsx), each resident card shows an Age value derived from resident.dob.",
        "The age display is a whole number of years (e.g., \"Age: 78\").",
        "If resident.dob is missing/empty or not parseable, the UI does not crash and shows a sensible fallback (e.g., \"Age: —\")."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/ResidentDashboardPage.tsx",
          "operation": "modify",
          "description": "Add an \"Age\" row to each resident card near the existing DOB row; compute the value from resident.dob using the shared timezone-safe date-only utility and render a fallback (e.g., em dash) when missing/unparseable."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Implement timezone-safe, date-only age calculation based on DOB YYYY-MM-DD components (no timezone/DST day shifting).",
      "acceptanceCriteria": [
        "The age calculation uses the DOB string (expected format from <input type=\"date\">, e.g., YYYY-MM-DD) and compares against today’s date using date-only logic (year/month/day), not a time-based conversion that can change the DOB day.",
        "For a DOB close to a day boundary (e.g., \"2000-01-01\"), the computed age is the same regardless of the user’s local timezone.",
        "Age increments on the resident’s birthday (based on month/day comparison), not at an arbitrary time of day."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/dateOnly.ts",
          "operation": "create",
          "description": "Create a small date-only utility that parses a DOB in YYYY-MM-DD without constructing a timezone-sensitive Date from the DOB; expose a helper like calculateAgeYears(dob: string, today?: {year:number;month:number;day:number}) returning a whole-number age or null when invalid."
        },
        {
          "path": "frontend/src/pages/ResidentDashboardPage.tsx",
          "operation": "modify",
          "description": "Use the new date-only age helper for Age rendering, ensuring month/day birthday comparison logic drives age increment and that invalid DOB strings do not throw."
        }
      ]
    }
  ]
}