{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Resident profile editor solid white/black background toggle (frontend)",
  "requirements": [
    {
      "id": "REQ-2",
      "summary": "Add a Display Preferences control in Settings to toggle resident profile editor background mode (solid white/solid black) and persist via existing Save Changes flow.",
      "acceptanceCriteria": [
        "Settings displays a clearly labeled control (English UI text) for the resident profile editor background with two states: solid white and solid black.",
        "Changing the control causes the Save Changes button to appear (same behavior as existing showPrintProfileButton).",
        "After saving, the preference is persisted and is reflected on reload (via useGetAppSettings)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/SettingsPage.tsx",
          "operation": "modify",
          "description": "Extend Settings state initialization from useGetAppSettings to include displayPreferences.residentProfileEditorBackgroundMode; render a new clearly-labeled two-state control under Display Preferences; update hasChanges logic to include both fields; update handleSave to send a complete DisplayPreferences object including both showPrintProfileButton and residentProfileEditorBackgroundMode via the existing useUpdateDisplayPreferences Save Changes flow."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Apply the selected solid white/solid black background mode to resident profile editing UI (modal + add/edit pages) with scoped high-contrast form styling, without affecting the rest of the app theme.",
      "acceptanceCriteria": [
        "When the editor background mode is set to solid white, resident profile edit screens render with a solid white background and dark, readable text; form controls remain clearly visible.",
        "When the editor background mode is set to solid black, resident profile edit screens render with a solid black background and light, readable text; form controls remain clearly visible.",
        "The behavior applies at minimum to the Edit Resident Information modal (frontend/src/components/residents/modals/EditResidentInformationModal.tsx) and the resident-profile add/edit pages (e.g., insurance/pharmacy/physicians/responsible persons).",
        "The chosen mode affects editing screens only and does not unintentionally force the entire app into light/dark mode."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useResidentProfileEditorBackgroundMode.ts",
          "operation": "create",
          "description": "Add a small helper hook that reads displayPreferences.residentProfileEditorBackgroundMode from useGetAppSettings and returns a stable mode value plus a scoped CSS className to apply to resident profile editor screens (defaulting safely when settings are not yet available)."
        },
        {
          "path": "frontend/src/components/resident-profile/ResidentProfileEditorSurface.tsx",
          "operation": "create",
          "description": "Create a wrapper component used by resident profile edit/add screens that applies the mode-specific surface class (from the background mode hook) and provides a consistent container for editor-only styling without impacting global app theming."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Add editor-scoped utility/classes for solid white and solid black modes (e.g., resident-profile editor surface classes) that set background + foreground and enforce high-contrast styling for labels, text, inputs, selects, textareas, and cards within the editor surface only; ensure the styles do not change the rest of the app or introduce a global dark-mode system."
        },
        {
          "path": "frontend/src/components/residents/modals/EditResidentInformationModal.tsx",
          "operation": "modify",
          "description": "Apply the resident profile editor surface styling to the Edit Resident Information modal: replace the hard-coded dialog-solid-white usage with mode-driven editor surface styling so the modal background and all contained form controls adapt for solid white/black with strong contrast while keeping changes scoped to this editing experience."
        },
        {
          "path": "frontend/src/pages/resident-profile/insurance/InsuranceAddPage.tsx",
          "operation": "modify",
          "description": "Wrap the add-insurance form page content in ResidentProfileEditorSurface (or apply the mode-specific class from the background hook) and remove the hard-coded Card bg-white so the page renders as solid white/black with readable text and visible form controls."
        },
        {
          "path": "frontend/src/pages/resident-profile/insurance/InsuranceEditPage.tsx",
          "operation": "modify",
          "description": "Wrap the edit-insurance form page content in ResidentProfileEditorSurface (or apply the mode-specific class from the background hook) and remove the hard-coded Card bg-white so the page renders as solid white/black with readable text and visible form controls."
        },
        {
          "path": "frontend/src/pages/resident-profile/pharmacy/PharmacyAddPage.tsx",
          "operation": "modify",
          "description": "Wrap the add-pharmacy form page content in ResidentProfileEditorSurface (or apply the mode-specific class from the background hook) and remove the hard-coded Card bg-white so the page renders as solid white/black with readable text and visible form controls."
        },
        {
          "path": "frontend/src/pages/resident-profile/pharmacy/PharmacyEditPage.tsx",
          "operation": "modify",
          "description": "Wrap the edit-pharmacy form page content in ResidentProfileEditorSurface (or apply the mode-specific class from the background hook) and remove the hard-coded Card bg-white so the page renders as solid white/black with readable text and visible form controls."
        },
        {
          "path": "frontend/src/pages/resident-profile/physicians/PhysicianAddPage.tsx",
          "operation": "modify",
          "description": "Wrap the add-physician form page content in ResidentProfileEditorSurface (or apply the mode-specific class from the background hook) and remove the hard-coded Card bg-white so the page renders as solid white/black with readable text and visible form controls."
        },
        {
          "path": "frontend/src/pages/resident-profile/physicians/PhysicianEditPage.tsx",
          "operation": "modify",
          "description": "Wrap the edit-physician form page content in ResidentProfileEditorSurface (or apply the mode-specific class from the background hook) and remove the hard-coded Card bg-white so the page renders as solid white/black with readable text and visible form controls."
        },
        {
          "path": "frontend/src/pages/resident-profile/responsible-persons/ResponsiblePersonAddPage.tsx",
          "operation": "modify",
          "description": "Wrap the add-responsible-person form page content in ResidentProfileEditorSurface (or apply the mode-specific class from the background hook) and remove the hard-coded Card bg-white so the page renders as solid white/black with readable text and visible form controls (including checkbox/labels)."
        },
        {
          "path": "frontend/src/pages/resident-profile/responsible-persons/ResponsiblePersonEditPage.tsx",
          "operation": "modify",
          "description": "Wrap the edit-responsible-person form page content in ResidentProfileEditorSurface (or apply the mode-specific class from the background hook) and remove the hard-coded Card bg-white so the page renders as solid white/black with readable text and visible form controls (including checkbox/labels)."
        }
      ]
    }
  ]
}